/*
 * valueType.h
 *
 *  Created on: 2018年5月9日
 *      Author: 13341
 */
#ifndef _VALUETYPE_H
#define _VALUETYPE_H

#include "cpu.h"

//=====================================================================
//函数名称：IntConvertToStr
//函数返回：无
//参数说明：num：待转换为字符串的数字；str：字符串转换完成后存储的位置；
//功能概要：将指定进制的整型数转为字符串
//=====================================================================
uint8_t *IntConvertToStr(int num,uint8_t *str);

//=====================================================================
//函数名称：DoubleConvertToStr
//函数返回：无
//参数说明：num：待转换为字符串的数字；n:保留小数位数；str：字符串转换完成后存储的位置；
//功能概要：将指定进制的浮点数型数转为字符串
//=====================================================================
uint8_t *DoubleConvertToStr(double num,int n,uint8_t *str);


//================================================================
//函数名称：FloatConvertToStr
//函数返回：转换完成后所得到的字符串首地址，以'\0'结尾
//参数说明：x：待转换的双精度浮点数；
//          m：转换后保留小数的位数；
//          buf：字符串转换完成后存储的位置；
//功能概要：将浮点数转为字符串
//=================================================================
char *FloatConvertToStr(float x,int num,char *buf);
#endif
