//======================================================================
//文件名称：isr.c
//功能概要： 中断底层驱动构件源文件
//版权所有：SD-ARM(sumcu.suda.edu.cn)
//更新记录：2019-09-27 V1.0
//======================================================================
.include "include.inc"

//start 函数定义区域
.type  USART2_IRQHandler, function
.global USART2_IRQHandler
//end  函数定义区域

//========================中断函数服务例程===================================
.section .text
//======================================================================
//程序名称：UART_User_Handler（UARTA接收中断处理程序）
//触发条件：收到一个字节触发
//程序功能：回发接收到的字节
//======================================================================
UART_User_Handler:
//（1）屏蔽中断，并且保存现场
      cpsid  i          //关可屏蔽中断
      push {r7,lr}      //r7,lr进栈保护（r7后续申请空间用，lr中为进入中断前pc的值）
      //uint_8 flag
	  sub sp,#4         //通过移动sp指针获取地址
	  mov r7,sp         //将获取到的地址赋给r7
//（2）接收字节
      mov r1,r7         //r1=r7 作为接收一个字节的地址
      mov r0,#UART_User		//r0指明串口号
      bl  uart_re1      //调用接收一个字节子函数
//（3）发送字节
      mov r1,r0			//r1存放串口接收到的数据，作为uart_send1的入口参数
      mov r0,#UART_User		//r0指明串口号
      bl  uart_send1    //向原串口回发
//（4）解除屏蔽，并且恢复现场
      cpsie   i         //解除屏蔽中断
      add r7,#4         //还原r7
      mov sp,r7         //还原sp
      pop {r7,pc}       //r7,pc出栈，还原r7的值；pc←lr,即返回中断前程序继续执行