//==========================================================================
//文件名称：wdog.c
//功能概要：STM32L431RC 独立看门狗底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//==========================================================================
#include "wdog.h"

// ===========================================================================
// 函数名称：wdog_start
// 函数参数：timeout:设置重装载的时间
// 函数返回：无
// 功能概要： 启动看门狗模块
// ===========================================================================
void wdog_start(uint32_t timeout)
{
	IWDG->KR = IWDG_KEY_WRITE_ACCESS_ENABLE;    //使能对IWDG_PR和IWDG_RLR的写操作
	IWDG->PR = IWDG_PRESCALER_64;               //设置IWDG的预分频值
	IWDG->RLR = timeout;               //设置重装载的时间
	IWDG->KR = IWDG_KEY_RELOAD;    //重装载看门狗计数器
	IWDG->KR = IWDG_KEY_ENABLE;    //使能看门狗
}

// ===========================================================================
// 函数名称：wdog_feed
// 函数参数：无
// 函数返回：无
// 功能概要： 喂狗，重载计时器
// ===========================================================================
void wdog_feed(void)
{
	IWDG->KR = IWDG_KEY_RELOAD;    //重装载看门狗计数器
}

void wdog_stop(void)
{
}

